
## Plan Result

[CI link](https://github.com/kazuki-iwanaga/iwanaga-sandbox/actions/runs/7725492807)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_sql_database_instance.db


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_sql_database_instance.db will be created
  + resource "google_sql_database_instance" "db" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "db"
      + private_ip_address             = (known after apply)
      + project                        = "iwanaga-sandbox-dev"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + database_flags {
              + name  = "log_checkpoints"
              + value = "on"
            }
          + database_flags {
              + name  = "log_connections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_disconnections"
              + value = "on"
            }
          + database_flags {
              + name  = "log_lock_waits"
              + value = "on"
            }
          + database_flags {
              + name  = "log_temp_files"
              + value = "0"
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + require_ssl                                   = true
              + ssl_mode                                      = (known after apply)

              + authorized_networks {
                  + name  = "internal"
                  + value = "10.0.0.1/24"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-apply","PRNumber":6,"Program":"tfcmt","SHA1":"1dc1996bef8590b4b05328e6499bfc2eff177d71","Vars":{},"WorkflowName":"terraform-stg"} -->